# Taps
tap "heroku/brew"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "puma/puma"

# Brews
brew "bat"
brew "curl"
brew "diff-so-fancy"
brew "emojify"
brew "fzf"
brew "git"
brew "gnupg"
brew "heroku/brew/heroku"
brew "imagemagick"
brew "less"
brew "lf"
brew "mailcatcher", restart_service: true
brew "nodenv"
brew "openssl"
brew "postgresql", restart_service: true
brew "puma/puma/puma-dev"
brew "pyenv"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "stow"
brew "tmux"
brew "translate-shell"
brew "tree"
brew "universal-ctags"
brew "wget"
brew "yarn"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Casks
cask "appcleaner"
cask "brave-browser"
cask "font-iosevka"
cask "iterm2"
cask "rectangle"
cask "slack"

# Apps from App Store
mas "CopyClip", id: 595191960
