# Taps
tap "heroku/brew"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "puma/puma"

# Brews
brew "bat"
brew "diff-so-fancy"
brew "docker"
brew "emojify"
brew "elixir"
brew "flyctl"
brew "fzf"
brew "git"
brew "gh"
brew "heroku/brew/heroku"
brew "imagemagick"
brew "mailcatcher", restart_service: true
brew "nodenv"
brew "openssl"
brew "postgresql", restart_service: true
brew "puma/puma/puma-dev"
brew "pyenv"
brew "rbenv"
brew "redis", restart_service: true
brew "romkatv/powerlevel10k/powerlevel10k"
brew "stow"
brew "tmux"
brew "translate-shell"
brew "tree"
brew "vim"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Casks
cask "bitwarden"
cask "brave-browser"
cask "discord"
cask "garmin-express"
cask "google-drive"
cask "insomnia"
cask "iterm2"
cask "libreoffice"
cask "notion"
cask "notion-calendar"
cask "slack"
cask "stats"
cask "steam"
cask "visual-studio-code"
cask "whatsapp"

# Apps from App Store
mas "CopyClip", id: 595191960
